{"_id":{"$oid":"5eba70948db13637b055c25a"},"title":"An Introduction to Clustering Algorithms in Python","description":"In data science, we often think about how to use data to make predictions on new data points. This is called “supervised learning.” Sometimes, however, rather than ‘making predictions’, we instead want to categorize data into buckets. This is termed “unsupervised learning.” To illustrate the difference, let’s say we’re at a major pizza chain and we’ve been tasked with creating a feature in the order management software that will predict delivery times for customers. In order to achieve this, we are given a dataset that has delivery times, distances traveled, day of week, time of day, staff on hand, and volume of sales for several deliveries in the past. From this data, we can make predictions on future delivery times. This is a good example of supervised learning. Now, let’s say the pizza chain wants to send out targeted coupons to customers. It wants to segment its customers into 4 groups: large families, small families, singles, and college students. We are given prior ordering data (e.g. size of order, price, frequency, etc) and we’re tasked with putting each customer into one of the four buckets. This would be an example of “unsupervised learning” since we’re not making predictions; we’re merely categorizing the customers into groups.","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5eba70cb8db13637b055c25b"},"title":"What’s Up With the Recurring Quarantine Nightmares?","description":"Inmy recent dreams, I often find myself in filthy, broken-down bathrooms with stall walls that are too short and doors that don’t lock. I try to find a place to pee in private, but I never can. Other people can see me using the bathroom. I am panicked and embarrassed. The dream has happened enough times that I started poking around to find out whether others were experiencing especially vivid bad dreams right now. In my search, I came across the blog I Dream of Covid — run by Bay Area resident Erin Gravley, who was interested in seeing how the current pandemic would affect dreams — which allows people across the globe to submit descriptions of their pandemic dreams. Since its first post on March 13, the site has amassed more than 130 reports, many of which depict the same kind of distress I’ve been experiencing while asleep. Unpleasant and strange as these bad dreams might be for those of us having them, sleep experts aren’t surprised. “In a situation like the current one with Covid-19, with an increase in background stress, it makes sense that we might experience more disturbing dreams,” says Alex Dimitriu, MD, founder of Menlo Park Psychiatry and Sleep. “Freud, in his dream analysis, also referred to something known as ‘day residue.’” Day residue describes waking-life events that appear in our dreams and nightmares. These images and scenes typically pop up during the rapid eye movement (REM) sleep phase, according to Dimitriu, which tends to take place during the second half of the night. There are two main types of bad dreams: anxiety dreams and nightmares. Research suggests different people are experiencing different types of bad dreams, based mainly on their pandemic experiences. “Nightmares are usually defined as feeling overwhelming terror,” says Deirdre Barrett, PhD, author of The Committee of Sleep and an assistant professor of psychology at Harvard Medical School. “Anxiety [dreams generally have an] unpleasant, fearful emotion throughout… but not the sense of totally losing control.” Barrett is currently conducting an ongoing survey on the topic of Covid-19 dreams; she has collected over 6,000 dreams and agrees that the pandemic seems to be stirring up our dream lives. Among people who have submitted their dreams to Barrett’s survey, a majority are having anxiety dreams, but not recurrent ones (in which the same exact dream is repeated), she says. Many involve images that seem to be metaphors for the coronavirus: “Bugs are a problem,” she says. “I think that’s partly because we use the word ‘bug’ as slang for ‘virus.’” Health care workers she’s surveyed, on the other hand, have been reporting an increase in nightmares — some of which are recurrent. “[Health care workers are] having classic post-traumatic nightmares that… don’t tend to use metaphors,” she says. “They tend to be about things they’ve experienced by day.” Some health care workers, for example, are having nightmares in which they are failing to save a dying Covid-19 patient.","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5eba71338db13637b055c25c"},"title":"6 Best Practices & Pro Tips when using Angular CLI","description":"Developing Angular apps with Angular CLI is a very pleasurable experience! Angular team provided us with amazing CLI which supports most of the things which are needed for any serious project out of the box. Standardized project structure with full testing capabilities (both unit and e2e testing), code scaffolding, production grade build with support for using environment specific configuration. That’s a dream come true and lots of saved hours on every new projects. Thank you Angular team! 💖 While Angular CLI works great from the get go, there are some potential configuration improvements and best practices we can utilize to make our projects even better! What are we going to learn Best practices for architecture with Core, Shared and lazy-loaded Feature modules Using aliases for app and environments folders to support cleaner imports Why and how to use Sass and Angular Material How to setup good production build How to wave PhantomJS goodbye and use Headless Chrome instead (testing) How to release our project with automatically generated changelog and correct version bump","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5eba71fa8db13637b055c25d"},"title":"The words add up!","description":"When you were learning math, did you ever think about adding things other than numbers? If 1 + 2 = 3, then why couldn’t you say “green + fruit = apple?” Today, as we’re teaching the infant brains of artificial intelligence about the human world, it turns out that we can do just that. In order to teach machines to interpret human language, we have to teach them about the relationships between words. One approach to doing this is to train an algorithm with vast amounts of text. Fortunately, one thing our society is good at is generating vast amounts of text! One of the first attempts at this that I encountered was the technique of Markov chains. The idea of a Markov chain is that you can predict the probability of next steps in a series of events from knowing the current one. Think about how autocomplete works on your cellphone. By training a machine with example data, you can predict the likely next outcome of a sequence. Markov chains have a lot of fun applications, such as computer generated music. If you train them with natural language, you can generate sentences that look superficially like language, and most often are plain hilarious. Check out “Schmipsum”, which lets you generate filler text based on a variety of sources, including Shakespeare, and corporate mission statements:","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5eba723f8db13637b055c25e"},"title":"ICC 2019 Cricket World Cup Prediction using Machine Learning","description":"The 2019 ICC Men’s Cricket World Cup is ready to begin on Thursday (30th May). This 12th edition of the Cricket World Cup will run for almost one and a half month in England and Wales. The tournament will be contested by 10 teams who will be playing in a single round-robin group, with the top four at the end of the group phase progressing to the semi-finals. Predicting the future sounds like magic whether it be detecting in advance the intent of a potential customer to purchase your product or figuring out where the price of a stock is headed. If we can reliably predict the future of something, then we own a massive advantage. Machine learning has only served to amplify this magic and mystery. Applications The main objective of sports prediction is to improve team performance and enhance the chances of winning the game. The value of a win takes on different forms like trickles down to the fans filling the stadium seats, television contracts, fan store merchandise, parking, concessions, sponsorships, enrollment and retention. Data Real world data is dirty. We can’t expect a nicely formatted and clean data as provided by Kaggle. Therefore, data pre-processing is so crucial that I can’t stress enough how important it is. It is the most important stage as it could occupy 40%-70% of the whole workflow, just to clean the data to be fed to your models. I scraped three scripts from Crickbuzz website comprising of rankings of teams as of May 2019, details of the fixtures of 2019 world cup and details of each team’s history in previous world cups. I stored the above piece of data in three separate csv files. For the fourth file, I grabbed odi data-set for matches played between 1975 and 2017 from Kaggle in another csv file. In this file, I removed all the data from 1975 to 2010. This was done as the results of the last few years should only matter for our predictions. Since I didn’t get the data for 2018 and 2019 so this model might not be that accurate but still I believe this gives a fairly good idea. Then I did manual cleaning of the data as per my needs to make a machine learning model out of it.","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5eba72928db13637b055c25f"},"title":"A simple introduction to Machine Learning","description":"Introduction We are currently living in a “data era,” where a vast amount of data is collected and stored every day. In the face of this growing quantity of data, machine learning methods have become inescapable. So much so that you probably use them dozens of times a day without even noticing! Let’s start with an example of an “everyday” machine learning contribution for millions of users: the algorithm behind Facebook’s News Feed. Facebook uses machine learning to exploit users’ data and feedback to personalize their feeds. If you “like” a post or stop scrolling to read something, the algorithm learns from this and starts to populate your feed with further similar content. This learning is done continuously, and so the material suggested in your News Feed evolves with your preferences, making your user experience more enjoyable.","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5eba72cb8db13637b055c260"},"title":"Scaling Machine Learning","description":"About the speaker: Razvan Peteanu’s current role is Lead Architect — Machine Learning at TD Securities. He has 25 years of experience in software development, mostly in the financial industry. His focus over the last several years has been on building scalable machine learning solutions, in the cloud or on premise. About the talk: Some of the libraries very commonly taught and used in data science have not been designed for large scale machine learning so scaling up computation can be a challenge, particularly that many courses tend to focus on the algorithms and do not cover ML engineering. On the positive side, there are many ways to address this today and choosing the right one for a given project is an important decision as changing architectures can be expensive. The talk will go through the pros and cons of several approaches to scale up machine learning, including very recent developments.","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5eba73648db13637b055c261"},"title":"India-Corona is already here, in the asymptomatic youth","description":"Yesterday I called my younger brother Vipul, a doctor in New York, after reading about how doctors are increasingly getting infected in Europe. He told me that there is no hiding for him anymore — Corona is here. He had many patients admitted already, and many doctors and people are coughing. It seems like the world is already infected, we are just not accepting it, still hoping somehow we won’t get it. While the top scientists are saying, 70% of the world will get infected and most of us will just get a routine viral fever. My younger brother is at the frontline of the war, while I am hiding in my room at Stanford, how ironic. Tables have indeed turned in my life; fear like most of the world had gotten to best of me. How far I have come, from being a doctor in Lok Nayak Hospital, Delhi, from being the IAS commissioner of Kota city Municipal Corporation. This is the time to act not hide. What will happen to my brother in New York, to my grandfather in Jind, to my dear country India? What should I do? The picture seems very grim, from my viewpoint. But l must tell you what I am thinking. I have to prepare you; a lot of youth already have Coronavirus; they are just asymptomatic. What is happening in the world In the past three months, countries after countries are getting engulfed in the wave of Corona — China, the USA, Italy, Iran, and many more. The political leadership everywhere played it cool until the health ministers and presidents themselves started falling sick; until mass graves were detected from the sky; until doctors were forced to decide who to save and who to let die; until not even a single person was left on the bustling streets of Rome. Leaders have to keep calm and show strength; to keep the countries together. Yet, at the same time, their response can’t be guided by ignorance. Most of our knowledge of Corona is just two weeks old. However, two weeks seem a lifetime for Corona. We must learn from the mistakes and successes of China, Italy, Korea; and learn very fast, we only have one chance. Stage of Denial They say India will probably not see the worst of the infection, or we will be able to get away just by handwashing. Well, that reminds me of a childhood story, “When a pigeon sees a cat, it closes its eyes. That way, It assumes that since the pigeon can’t see the cat, the cat does not exist.” People in my home town are thinking China, Italy, are already struggling so is the USA, and they are safe, life is just normal. They need to know, that the virus will erupt once it has built up a self-sustainable base in the community. Real-world doesn’t work like, “The Walking Dead”. Don’t be delusional; all the countries of the world are on the same path. It takes for any infection, a specific time, and a minimum no of infected people to start a chain reaction, and once that happens, there is no stopping it. The time from the first infection to the thousandth, from first death to the thousandth, is the same in each country, not even a single exception. India is where Italy was three weeks back, and the USA was ten days back. We all are on the same path. After a threshold of 200 diagnosed cases and ten deaths, infection doubles every third day. See this data for yourself.","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5eba74098db13637b055c262"},"title":"Test Article","description":"Test Article","__v":{"$numberInt":"0"}}
